package th.go.dxc.share.util.jeasy.randomizer;

import java.util.Random;

import org.jeasy.random.api.Randomizer;

public class ThaiSurNameRandomizer implements Randomizer<String> {
	private final Random random = new Random();
	private final String[] THAI_SUR_NAME = { "อินสมบัติ", "เอมเกตุ", "พัดจันทร์หอม", "ประชาชู", "มาทิบ", "ดวงศิริ",
			"พันมี", "หงษ์ทอง", "นากัน", "ยอดต่อ", "คำท้วม", "เคยทำ", "รอดมั่น", "นาคชา", "วังซ้าย", "แก้วเข้ม",
			"แก้วเกตุ", "คำคล้าย", "นวลแหยม", "บุญเสือ", "หันจันทร์", "อนุเคราะห์", "ศรีพระธาตุ", "คำก้อน", "จาดศรี",
			"ร่วมวงศ์", "บุญเสือ", "จูธารี", "สมใจ", "ดีน้อย", "ยอดประเสริฐ", "คุ้มทัศ", "มีนาค", "ศรีเมือง",
			"ข้องเกี่ยวพันธุ์", "พรหมจุ้ย", "พุฒปราง", "สายบัวต่อ", "บุญนาค", "แผลงศร", "นาคชา", "เน่าดง", "ทับทอง",
			"ตาคำชัย", "ภู่ประเสริฐ", "นิ่มปาน", "ตุ้มพงษ์", "ขำปู่", "ยอดนางรอง", "เนียมเครือ", "จำปาขาว", "ทีบำรุง",
			"วงศ์ชมพู", "จันทร์ศิริประภา", "กิ่งจ้อ", "ใจรัมย์", "อินทร์เทศ", "กาดกอเสริม", "สุขมี", "มงคลทอง",
			"อยู่ช้าง", "จันทะคุณ", "ดีคำน้อย", "สวนปาน", "คงแก้ว", "สาจิ๋ว", "เกลียวกลม", "พฤฒิสาร", "ทองแก้ว",
			"รอดเส็ง", "มายางแดง", "สมใจ", "นุ่มเพ็ชร", "สุกแตง", "กลิ่นท้วม", "ดีครีพ", "อ่อนคงทิม", "สาจิ๋ว",
			"รวมสุข", "พุ่มดี", "เนืองเสน", "ชอบธรรม", "วงศ์พนัส", "เยขะจร", "ขำกลาง", "ปั้นโต", "โพธิ์ศรี",
			"เผือกเหลือง", "ม่วงเนียม", "กันจ้อย", "เดื่อทอง", "สุขช่วย", "นิลสวัสดิ์", "อ้นทรัพย์", "จอมคำสิงห์",
			"พัดจันทร์หอม", "พรหมชาติ", "บุรีรักษ์", "พินเมือง", "อินสิทธิ์", "ฐิตะสาร", "อินทร์รุ่ง", "ดวงแก้ว",
			"สนอ่อง", "ทองศรีสังข์", "อ้นอ๊อด", "จวงแย้ม", "พุกน้อย", "จวงแย้ม" };

	@Override
	public String getRandomValue() {
		return THAI_SUR_NAME[random.nextInt(THAI_SUR_NAME.length)];
	}

}
