package th.go.dxc.share.util.jeasy.randomizer;

import java.util.Random;

import org.jeasy.random.api.Randomizer;

public class ThaiGivenNameRandomizer implements Randomizer<String> {
	private final Random random = new Random();
	private final String[] THAI_GIVEN_NAME = { "อภิสิทธิ์ ", "อดิศักดิ์", "อักขระ ", "อริศรา", "อมร ", "อมรรัตน์ ",
			"อนันต์ ", "อนันตชัย", "อาณัติ ", "อัญชลี", "อัญชลีพร", "อนุชา ", "อาภัสรา", "อภิชาต", "อภิชาติ",
			"อภิรักษ์", "อภิศักดิ์", "อภิญญา ", "อารี ", "อารีพงศ์", "อารง", "อาทิตย์ ", "อรุณศรี", "อัษรา", "อัษฎา ",
			"อรรถสิทธิ์", "บัณฑิตา", "บัญญัติ ", "บุญศรี", "บุญรัตน์", "บุญเยี่ยม", "บุญยง", "บุษราคัม ", "บุศวรรณ",
			"ชัยอนันต์", "ชัยพร", "จักรี ", "เฉลิม ", "ฉลวย ", "ชนะ ", "ชาญชัย", "ชนินทร์", "ชนิภรณ์ ", "จันทร์สิริ",
			"เชาวน์ ", "ชาติชาย", "ชาติ ", "จตุพล", "ชิด ", "ชมเกดุ", "ชุ่ม ", "ชวน ", "จุลภาส", "ชูวิทย์", "ดนัย",
			"แดง ", "ดนุพล", "ดวงใจ", "ดวงกมล ", "เดือนเพ็ญ ", "ดุสิต ", "เอกใหม่", "เอกพงษ์", "ฟุ้งฟ้า", "กานดา ",
			"แก้วเก้า", "กมล ", "กนกพร", "กระสินธ์ ", "หทัย ", "จันทนา", "จารุวรรณ", "จินตหรา", "จินทนา", "เจือ ",
			"กาญจนา", "เกษม", "ขจี ", "ขนิษฐา ", "คลัง ", "ขวัญจิต", "กิติ", "กล้าหาญ", "กฤษฏิ์", "กุมโชค", "กุญชนิตา",
			"กุลพันธ์", "ขวัญชัย", "ขวัญใจ", "มาลี ", "มะลิ ", "มณี ", "มาณี", "มานิจ", "มโน ", "มณู", "มนู ",
			"มานิตย์ ", "มารวย", "มงคล ", "มนตรี ", "มุกดา ", "นาค ", "นัยนา ", "นาก ", "เนาวรัตน์", "นภสร", "นารี",
			"นรินทร์ศักดิ์", "นริศา ", "ณรงค์ศักดิ์", "นฤมล", "ณัฏฐสิทธิ์", "นววรรณ", "ณี ", "หนิว ", "นีราชา ",
			"นิตยา", "นงลักษณ์", "นงนุช", "นพดล", "นพคุณ ", "นพรัตน์", "ณัฎฐา", "ณัฐิมา", "ไพรัช ", "ไพฑูรย์ ",
			"ปกรณ์ ", "ปานใจ", "ผาณิต ", "พนิต ", "พรรณี", "พนม ", "ปานเทพ", "ภานุพัฒน์", "ปาริชาติ", "ปริญญา ",
			"ภาสุระ", "พัชรพร", "พาที", "ปฐม ", "ปฏิภาณ ", "พัฒนา ", "ปวีณา", "เพ็ญสุขภรณ์", "ปีย์รติ", "เพิ่ม ",
			"เผด็จ ", "ไพบูลย์ ", "ไพศักดิ์", "ไพศาล ", "พาณิชย์ ", "พยนต์ ", "พิชิต ", "พิจิตร ", "พิมพ์ใจ", "พินิจ ",
			"พิภพ ", "พิริยะ", "ภิรมย์ ", "พลเดช", "ผ่องเพ็ญ", "พรพันธุ์ ", "พรพรรณ ", "ภรณ์พรรณ ", "ภรณ์พันธ์ ",
			"ภรณ์พันธุ์ ", "พรรัมภา", "ภุชงค์ ", "ภูมินทร์ ", "ภูมิพัฒน์", "พูนศักดิ์", "พิกุล ", "พิมพ์วสี",
			"พิราวรรณ์", "ปีติ ", "ปิติ ", "ปิยบุตร", "ปิยะคม", "ปิยวรรณ", "ป้อง ", "พรชัย", "ประชา ", "ประดิษฐ์ ",
			"ประมนต์", "ประมุข ", "ปราณี", "ประพันธ์ ", "ประภาส ", "ประสาน ", "ประเสริฐ ", "ประสิทธิ์ ", "ประสงค์ ",
			"ปรารถนา ", "ประทีป ", "ประทุม", "ปรัชญา ", "ประเวช", "ประเวศ", "ประวิทย์ ", "ประวิตร", "ปรีชา ", "ปรีดา",
			"เปรม ", "ปัญญา", "ราม ", "รังรอง", "รินรดา", "รอง ", "ฤดี ", "รื่น ", "รื่นฤดี", "รุ่งสิทธิ์", "รัตน์ ",
			"ฤทัย ", "แสงดาว", "สายพิณ", "สายสมร", "ศักดา ", "สากล ", "ศักดิ์ทิพย์", "สกุล ", "สลิลธร", "สมัคร ",
			"สามารถ ", "สมร ", "สำเริง", "สำรวย", "สนั่น ", "สังวาล ", "สังวาลย์", "สนิท ", "สันติ ", "สริตา", "ศศิธร ",
			"สาธิต ", "สาธิตยัง", "สว่าง ", "สวัสดิ์", "สาวิทย์", "เสรี ", "เซติอาวัน", "เซติยัง", "สิงห์ ", "ศิริ ",
			"ศิริโชค", "สิริกิติ์ ", "ศิริณี", "ศิริพันธ์", "ศิริพล", "ศิริพงศ์", "ศิริพร", "สิริรักษ์", "ศิริรัตน์",
			"ศิริวรรณ", "ศรีศักดิ์", "สีห์ศักดิ์", "สิทธิ ", "โสภาค", "สมบัติ ", "สมบูรณ์ ", "สมบุญ", "สมชาย", "สมโชค",
			"สุดใจ", "สมจิต", "สมคิด", "สมควร ", "สมลักษณ์", "สมหมาย", "สมเพียร", "สมภพ ", "สมพงษ์ ", "สมพร", "สมรัตน์",
			"สมศักดิ์", "สมทรง", "สมศรี", "สมยศ", "สนธิ ", "สุนทรี", "สุชาดา", "สุชาดาจะ", "สุชาย", "สุชาติ", "สุจินดา",
			"สุดา ", "สุกัญญา", "สุหัตถ์", "สุจิต ", "สุเมธ", "สุนัย", "สุนีย์ ", "สุนี", "สุภา", "ศุภชัย", "สุภาภรณ์",
			"ศุภวิทย์", "สุพรรณ ", "สุภาพ ", "ศุภวุฒิ", "สุพิชา ", "สุพิศ", "ศุภผล", "ศุภรัตน์", "สุประภา", "สุรัตน์",
			"สุรี", "สุริยา ", "สุริยะ ", "สุธรรม", "สุเทพ", "สุทธิพล", "สุทธิพงศ์", "สุวรรณ ", "สุวิชา ", "สุวิทย์",
			"ธเนศ ", "ตนุพล", "ธีรศักดิ์", "ทักษิณ ", "ธนากร", "ธนาพร", "ถนัด ", "ธนัชชา", "ทวีฉัตร", "ถวิล ", "ทวีป ",
			"ทวีศักดิ์", "ทวีวงศ์", "ธีรภัทร", "ฐิตวรรณ", "ฐิติภรณ์", "ธงชัย", "ทัศนีย์", "อุบล", "อุบลวรรณ", "อุดม ",
			"อุกิต", "อุกฤษฏ์", "อัญญาณี", "วีระ ", "วิโรจน์", "วรภัทร", "วานี", "วัลลภา", "วัลลภ", "วรรณ ", "วรรณา",
			"วันพล", "วราภรณ์", "วัชราภรณ์", "วัฒนา ", "วิชัย ", "วิจารณ์ ", "วิเชียร ", "วิจิตร ", "วิลาศ", "วินัย ",
			"วีรยุทธ์", "วิภา", "วิภาภรณ์", "วีระ", "วีระชาย", "วีระชาติ", "วีระพันธุ์", "วีระพล", "วิราภรณ์",
			"วีรศักดิ์", "วีระศักดิ์", "วิรัช ", "วิริยะ ", "วิสา", "วิเศษ ", "วิศิษฏ์", "วิทยา ", "วรพร", "ญาณิน",
			"เยาวพา", "ยิ่งยศ", "ยุพิน", "ยุทธ์", "ยุวรัตน์", "วัชรพล", "ผกามาศ" };

	@Override
	public String getRandomValue() {
		return THAI_GIVEN_NAME[random.nextInt(THAI_GIVEN_NAME.length)];
	}

}
